'use strict';
// -------------------------- Задание 5, дополнительное -------------

// ----------------------------- 1 ----------------------------------------------------------
let arr = ['123456', '4567891', '3456789', '765432', '2345432', '987654321', '476453992763'];

arr.forEach(elem => {
   if (elem[0] === '2' || elem[0] === '4') { console.log(elem); }
});


// ------------------------------ 2 ----------------------------------------------------------
// ----------------- решето Эратосфена -------------------------------------------------------

let simpleNumbers = [];

for (let i = 0; i <= 100; i++) {
   simpleNumbers[i] = true;
}


let p = 2;
let i;

do {
   for (i = 2 * p; i < 100; i += p) {
      simpleNumbers[i] = false;
   }
   for (i = p + 1; i < 100; i++) {
      if (simpleNumbers[i]) { break; }
   }
   p = i;

} while (p * p < 100);

for (i = 2; i < 100; i++) {
   if (simpleNumbers[i]) {
      console.log(`Число ${i} является простым. Его делители: 1 и ${i}`);
   }
}